espruino/Espruino/targets/nrf5x/bluetooth_ancs.c
/**
 * This file is part of Espruino, a JavaScript interpreter for Microcontrollers
 *
 * Copyright (C) 2020 Gordon Williams <gw@pur3.co.uk>
 *
 * This Source Code Form is subject to the terms of the Mozilla Public
 * License, v. 2.0. If a copy of the MPL was not distributed with this
 * file, You can obtain one at http://mozilla.org/MPL/2.0/.
 *
 * ----------------------------------------------------------------------------
 * Bluetooth Apple Notifications Handler
 * ----------------------------------------------------------------------------
 */

#include "jsinteractive.h"
#include "bluetooth.h"
#include "bluetooth_ancs.h"
#include "jswrap_bluetooth.h"

#include "app_timer.h"
#include "nrf_ble_ancs_c.h"
#include "nrf_ble_ams_c.h"
#include "ble_db_discovery.h"
#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble_hci.h"
#include "ble_gap.h"
#include "ble_advdata.h"
#include "ble_conn_params.h"
#include "peer_manager.h"
#include "app_timer.h"
#include "nrf_soc.h"
#include "fds.h"
#include "nrf_delay.h"

//=========================
//#define DEBUG
//=========================
/*

Serial1.setConsole(1)
NRF.setServices({},{ancs:true,ams:true})
NRF.setAdvertising({})

E.on('ANCS',a=>{
  print("ANCS", E.toJS(a));
});
// get message contents
NRF.ancsGetNotificationInfo( 1 ).then(a=>print("Notify",E.toJS(a))); // 1==id
// Get app name.
NRF.ancsGetAppInfo("com.google.hangouts").then(a=>print("App",E.toJS(a)));


NRF.setServices({},{ams:true})
E.on('AMS',a=>{
  print("AMS", E.toJS(a));
});
E.on('AMS',a=>{
  // eg. {id:"title",value:"Track Name too lon",truncated:true}
  //
  if (a.truncated)
    NRF.amsGetTrackInfo(a.id).then(n => print(a.id, n))
  else
    print(a.id, a.value);
});


// music control
NRF.amsCommand("play")
NRF.amsCommand("pause")

// Track information
NRF.amsGetTrackInfo("title").then(a=>print("Title:",a))
NRF.amsGetTrackInfo("artist").then(a=>print("Artist:",a))
NRF.amsGetTrackInfo("duration").then(a=>print("Duration:",a,"seconds"))

// Music player (and current playback status)
NRF.amsGetPlayerInfo("name").then(a=>print("Music app name:",a))
NRF.amsGetPlayerInfo("volume").then(a=>print("Volume:",a))
NRF.amsGetPlayerInfo("playbackinfo").then(a=>{
  p = a.split(',');
  playbackState = ['Paused','Playing','Rewinding','FastForwarding'][p[0]];
  playbackRate = parseFloat(p[1]);
  elapsedTime = parseFloat(p[2]);
  print(playbackState,"@ rate:",playbackRate,"- elapsed time:",elapsedTime,"seconds");
});


*/

#ifndef DEBUG
#define NRF_LOG_INFO(...)
#define NRF_LOG_DEBUG(...)
#else
#define NRF_LOG_INFO jsiConsolePrintf
#define NRF_LOG_DEBUG jsiConsolePrintf
#endif

/** Delay after connection until security request is sent, if necessary (ticks). */
#if NRF_SD_BLE_API_VERSION < 5
#define SECURITY_REQUEST_DELAY         APP_TIMER_TICKS(1500, APP_TIMER_PRESCALER)
#define NRF_SDH_BLE_GATT_MAX_MTU_SIZE (GATT_MTU_SIZE_DEFAULT - 3)
#else
#define SECURITY_REQUEST_DELAY         APP_TIMER_TICKS(1500)  
#endif  


APP_TIMER_DEF(m_sec_req_timer_id);                                     /**< Security request timer. The timer lets us start pairing request if one does not arrive from the Central. */
#if NRF_SD_BLE_API_VERSION < 5
static ble_ancs_c_t       m_ancs_c;                                    /**< Structure used to identify the Apple Notification Service Client. */
static ble_ams_c_t        m_ams_c;                                     /**< Structure used to identify the Apple Notification Service Client. */
static ble_db_discovery_t m_ble_db_discovery;                          /**< Structure used to identify the DB Discovery module. */
#else
BLE_ANCS_C_DEF(m_ancs_c);                                              /**< Apple Notification Service Client instance. */
BLE_AMS_C_DEF(m_ams_c);                                                /**< Apple Media Service Client instance. */
BLE_DB_DISCOVERY_DEF(m_ble_db_discovery);                              /**< DB Discovery module instance. */
#endif

static bool m_ancs_active = false;
static bool m_ams_active = false;
static ble_ancs_c_evt_notif_t m_notification_request;                   /**< Local copy to keep track of the newest arriving notifications. */
static ble_ancs_c_attr_t      m_notif_attr_latest;                     /**< Local copy of the newest notification attribute. */
static ble_ancs_c_attr_t      m_notif_attr_app_id_latest;              /**< Local copy of the newest app attribute. */

// TODO: could we use a single buffer and then just write each attribute to JsVars as we get it?
// ANCS APP
static char m_attr_appname[32];                         /**< Buffer to store attribute data. */
// ANCS NOTIFICATION
static char m_attr_appid[48];                           /**< Buffer to store attribute data. */
static char m_attr_title[64];                           /**< Buffer to store attribute data. */
static char m_attr_subtitle[64];                        /**< Buffer to store attribute data. */
static char m_attr_message[512];                        /**< Buffer to store attribute data. */
static char m_attr_message_size[16];                    /**< Buffer to store attribute data. */
static char m_attr_date[20];                            /**< Buffer to store attribute data. */
static char m_attr_posaction[16];                       /**< Buffer to store attribute data. */
static char m_attr_negaction[16];                       /**< Buffer to store attribute data. */
// static char m_attr_disp_name[32];                       /**< Buffer to store attribute data. */
//AMS state
static uint8_t m_entity_attribute[BLE_AMS_EA_MAX_DATA_LENGTH];

/** Handle notification event (called outside of IRQ by Espruino) - will poke the relevant events in */
void ble_ancs_handle_notif(BLEPending blep, ble_ancs_c_evt_notif_t *p_notif) {
  // Fire E.on('ANCS',...)
  JsVar *o = jsvNewObject();
  if (!o) return;
  const char * lit_eventid[BLE_ANCS_NB_OF_EVT_ID] = { "add", "modify", "remove" };
  jsvObjectSetChildAndUnLock(o, "event", jsvNewFromString(lit_eventid[p_notif->evt_id]));
  jsvObjectSetChildAndUnLock(o, "uid", jsvNewFromInteger(p_notif->notif_uid));
  jsvObjectSetChildAndUnLock(o, "category", jsvNewFromInteger(p_notif->category_id));
  jsvObjectSetChildAndUnLock(o, "categoryCnt", jsvNewFromInteger(p_notif->category_count));
  jsvObjectSetChildAndUnLock(o, "silent", jsvNewFromBool(p_notif->evt_flags.silent));
  jsvObjectSetChildAndUnLock(o, "important", jsvNewFromBool(p_notif->evt_flags.important));
  jsvObjectSetChildAndUnLock(o, "preExisting", jsvNewFromBool(p_notif->evt_flags.pre_existing));
  if (p_notif->evt_id == BLE_ANCS_EVENT_ID_NOTIFICATION_ADDED ||
      p_notif->evt_id == BLE_ANCS_EVENT_ID_NOTIFICATION_MODIFIED) {
    jsvObjectSetChildAndUnLock(o, "positive", jsvNewFromBool(p_notif->evt_flags.positive_action));
    jsvObjectSetChildAndUnLock(o, "negative", jsvNewFromBool(p_notif->evt_flags.negative_action));
  }
  jsiExecuteEventCallbackOn("E", JS_EVENT_PREFIX"ANCS", 1, &o);
  jsvUnLock(o);
}

/** Handle notification attributes received event (called outside of IRQ by Espruino) - will poke the relevant events in */
void ble_ancs_handle_notif_attr(BLEPending blep, ble_ancs_c_evt_notif_t *p_notif) {
  // Complete the ANCS notification attribute promise
  JsVar *o = jsvNewObject();
  if (!o) return;
  jsvObjectSetChildAndUnLock(o, "uid", jsvNewFromInteger(p_notif->notif_uid));
  jsvObjectSetChildAndUnLock(o, "appId", jsvNewFromString(m_attr_appid));
  jsvObjectSetChildAndUnLock(o, "title", jsvNewFromString(m_attr_title));
  jsvObjectSetChildAndUnLock(o, "subtitle", jsvNewFromString(m_attr_subtitle));
  jsvObjectSetChildAndUnLock(o, "message", jsvNewFromString(m_attr_message));
  jsvObjectSetChildAndUnLock(o, "messageSize", jsvNewFromString(m_attr_message_size));
  jsvObjectSetChildAndUnLock(o, "date", jsvNewFromString(m_attr_date));
  jsvObjectSetChildAndUnLock(o, "posAction", jsvNewFromString(m_attr_posaction));
  jsvObjectSetChildAndUnLock(o, "negAction", jsvNewFromString(m_attr_negaction));
  // jsvObjectSetChildAndUnLock(o, "name", jsvNewFromString(m_attr_disp_name));
  bleCompleteTaskSuccessAndUnLock(BLETASK_ANCS_NOTIF_ATTR, o);
}

/** Handle ANCS app attribue request */
void ble_ancs_handle_app_attr(BLEPending blep, char *buffer, size_t bufferLen) {
  // Complete the ANCS app attribute promise
  JsVar *o = jsvNewObject();
  if (!o) return;
  jsvObjectSetChild(o, "appId", bleTaskInfo);
  jsvObjectSetChildAndUnLock(o, "appName", jsvNewStringOfLength(bufferLen, buffer));
  bleCompleteTaskSuccessAndUnLock(BLETASK_ANCS_APP_ATTR, o);
}

/** Handle AMS track info update */
void ble_ams_handle_track_update(BLEPending blep, uint16_t data, char *buffer, size_t bufferLen) {
  NRF_LOG_DEBUG("AMS track update - data 0x%d, buffer:%s\n", data, buffer);
  bool isTruncated = data & 128;
  ble_ams_c_track_attribute_id_val_t attrId = data & 127;
  const char *idStr = "?";
  switch (attrId) {
    case BLE_AMS_TRACK_ATTRIBUTE_ID_ARTIST:
      idStr = "artist"; break;
    case BLE_AMS_TRACK_ATTRIBUTE_ID_ALBUM:
      idStr = "album"; break;
    case BLE_AMS_TRACK_ATTRIBUTE_ID_TITLE:
      idStr = "title"; break;
    case BLE_AMS_TRACK_ATTRIBUTE_ID_DURATION:
      idStr = "duration"; break;
  };
  JsVar *o = jsvNewObject();
  if (!o) return;
  jsvObjectSetChildAndUnLock(o, "id", jsvNewFromString(idStr));
  jsvObjectSetChildAndUnLock(o, "value", jsvNewStringOfLength(bufferLen, buffer));
  jsvObjectSetChildAndUnLock(o, "truncated", jsvNewFromBool(isTruncated));
  jsiExecuteEventCallbackOn("E", JS_EVENT_PREFIX"AMS", 1, &o);
  jsvUnLock(o);
}

/** Handle AMS player info update */
void ble_ams_handle_player_update(BLEPending blep, uint16_t data, char *buffer, size_t bufferLen) {
  NRF_LOG_DEBUG("AMS player update - data 0x%d, buffer:%s\n", data, buffer);
  bool isTruncated = data & 128;
  ble_ams_c_player_attribute_id_val_t attrId = data & 127;
  const char *idStr = "?";
  switch (attrId) {
    case BLE_AMS_PLAYER_ATTRIBUTE_ID_NAME:
      idStr = "name"; break;
    case BLE_AMS_PLAYER_ATTRIBUTE_ID_PLAYBACK_INFO:
      idStr = "playbackinfo"; break;
    case BLE_AMS_PLAYER_ATTRIBUTE_ID_VOLUME:
      idStr = "volume"; break;
  };
  JsVar *o = jsvNewObject();
  if (!o) return;
  jsvObjectSetChildAndUnLock(o, "id", jsvNewFromString(idStr));
  jsvObjectSetChildAndUnLock(o, "value", jsvNewStringOfLength(bufferLen, buffer));
  jsvObjectSetChildAndUnLock(o, "truncated", jsvNewFromBool(isTruncated));
  jsiExecuteEventCallbackOn("E", JS_EVENT_PREFIX"AMS", 1, &o);
  jsvUnLock(o);
}

/** Handle AMS attribute */
void ble_ams_handle_attribute(BLEPending blep, char *buffer, size_t bufferLen) {
  // Complete the AMS promise
  bleCompleteTaskSuccessAndUnLock(BLETASK_AMS_ATTR, jsvNewStringOfLength(bufferLen, buffer));
}


void ble_ancs_clear_app_attr() {
  memset(m_attr_appname      ,0, sizeof(m_attr_appname));
}

void ble_ancs_clear_attr() {
  memset(m_attr_appid        ,0, sizeof(m_attr_appid));
  memset(m_attr_title        ,0, sizeof(m_attr_title));
  memset(m_attr_subtitle     ,0, sizeof(m_attr_subtitle));
  memset(m_attr_message      ,0, sizeof(m_attr_message));
  memset(m_attr_message_size ,0, sizeof(m_attr_message_size));
  memset(m_attr_date         ,0, sizeof(m_attr_date));
  memset(m_attr_posaction    ,0, sizeof(m_attr_posaction));
  memset(m_attr_negaction    ,0, sizeof(m_attr_negaction));
  // memset(m_attr_disp_name    ,0, sizeof(m_attr_disp_name));
}

void ble_ancs_bonding_succeeded(uint16_t conn_handle) {
  NRF_LOG_INFO("ble_ancs_bonding_succeeded\n");
  uint32_t ret  = ble_db_discovery_start(&m_ble_db_discovery, conn_handle);
  APP_ERROR_CHECK_NOT_URGENT(ret);
}


