espruino/Espruino/targets/nrf5x/bluetooth_ancs.c
  case BLE_AMS_C_EVT_ENTITY_UPDATE_NOTIFICATION:
    NRF_LOG_INFO("BLE_AMS_C_EVT_ENTITY_UPDATE_NOTIFICATION: entity %d, attr %d\n", p_evt->entity_update_data.entity_id, p_evt->entity_update_data.attribute_id);
    if (p_evt->entity_update_data.entity_id == BLE_AMS_ENTITY_ID_PLAYER) {
      jsble_queue_pending_buf(BLEP_AMS_PLAYER_UPDATE,
          p_evt->entity_update_data.attribute_id | (p_evt->entity_update_data.entity_update_flag?128:0),
          p_evt->entity_update_data.p_entity_update_data, p_evt->entity_update_data.entity_update_data_len);
    } else {
      jsble_queue_pending_buf(BLEP_AMS_TRACK_UPDATE,
          p_evt->entity_update_data.attribute_id | (p_evt->entity_update_data.entity_update_flag?128:0),
          p_evt->entity_update_data.p_entity_update_data, p_evt->entity_update_data.entity_update_data_len);
    }
    break;

  case BLE_AMS_C_EVT_ENTITY_ATTRIBUTE_READ_RESP: {
    NRF_LOG_INFO("BLE_AMS_C_EVT_ENTITY_ATTRIBUTE_READ_RESP\n");
    jsble_queue_pending_buf(BLEP_AMS_ATTRIBUTE,
            0,
            p_evt->entity_attribute_data.p_entity_attribute_data, p_evt->entity_attribute_data.attribute_len);
    /* TODO: deal with very long track names:
    if (p_evt->entity_attribute_data.attribute_len
        < (NRF_SDH_BLE_GATT_MAX_MTU_SIZE - 3)) {
      NRF_LOG_INFO("Read Complete!\n");
    } else {
      NRF_LOG_INFO(
          "Read not complete. Call sd_ble_gattc_read() with offset: %d\n",
          (p_evt->entity_attribute_data.attribute_offset
              + p_evt->entity_attribute_data.attribute_len));
      ble_ams_c_entity_attribute_read(&m_ams_c,
          (p_evt->entity_attribute_data.attribute_offset
              + p_evt->entity_attribute_data.attribute_len));
    }*/
    break;
  }

  case BLE_AMS_C_EVT_DISCOVERY_FAILED:
    NRF_LOG_INFO("Apple Media Service not discovered on the server.\n");
    break;

  case BLE_AMS_C_EVT_ENTITY_UPDATE_ATTRIBUTE_ERROR:
    err_code_print_ams(p_evt->err_code_ms);
    break;
  default:
    // No implementation needed.
    break;
  }
}

/**@brief Function for handling the Apple Notification Service client errors.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void apple_notification_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for handling the Apple Notification Service client errors.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void apple_media_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for dispatching a BLE stack event to all modules with a BLE stack event handler.
 *
 * @details This function is called from the BLE Stack event interrupt handler after a BLE stack
 *          event has been received.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
void ble_ancs_on_ble_evt(const ble_evt_t * p_ble_evt)
{
#if NRF_SD_BLE_API_VERSION < 5
    ble_db_discovery_on_ble_evt(&m_ble_db_discovery, p_ble_evt);
    ble_ancs_c_on_ble_evt(&m_ancs_c, p_ble_evt);
    ble_ams_c_on_ble_evt(p_ble_evt, &m_ancs_c);
#endif

    ret_code_t ret = NRF_SUCCESS;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            NRF_LOG_INFO("Connected.\n");
            ret               = app_timer_start(m_sec_req_timer_id, SECURITY_REQUEST_DELAY, NULL);
            APP_ERROR_CHECK_NOT_URGENT(ret);
            break; // BLE_GAP_EVT_CONNECTED

        case BLE_GAP_EVT_DISCONNECTED:
            NRF_LOG_INFO("Disconnected.\n");
            ret               = app_timer_stop(m_sec_req_timer_id);
            APP_ERROR_CHECK_NOT_URGENT(ret);
            if ((bleStatus & BLE_ANCS_INITED) && p_ble_evt->evt.gap_evt.conn_handle == m_ancs_c.conn_handle) {
                m_ancs_c.conn_handle = BLE_CONN_HANDLE_INVALID;
            }
            if ((bleStatus & BLE_AMS_INITED) && p_ble_evt->evt.gap_evt.conn_handle == m_ams_c.conn_handle) {
                m_ams_c.conn_handle = BLE_CONN_HANDLE_INVALID;
            }
            m_ancs_active = false;
            m_ams_active = false;
            if (BLETASK_IS_ANCS(bleGetCurrentTask()))
                bleCompleteTaskFailAndUnLock(bleGetCurrentTask(), jsvNewFromString("Disconnected"));
            break; // BLE_GAP_EVT_DISCONNECTED
        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for initializing the Apple Notification Center Service.
 */
static void services_init(void) {
    ret_code_t        ret;

    ble_ancs_clear_attr();
    ble_ancs_clear_app_attr();

    if (bleStatus & BLE_ANCS_INITED) {
      ble_ancs_c_init_t ancs_init_obj;
      memset(&ancs_init_obj, 0, sizeof(ancs_init_obj));

      ret = nrf_ble_ancs_c_app_attr_add(&m_ancs_c,
                                    BLE_ANCS_APP_ATTR_ID_DISPLAY_NAME,
                                    (uint8_t*)m_attr_appname,
                                    sizeof(m_attr_appname));
      APP_ERROR_CHECK(ret);

      ret = nrf_ble_ancs_c_attr_add(&m_ancs_c,
                                    BLE_ANCS_NOTIF_ATTR_ID_APP_IDENTIFIER,
                                    (uint8_t*)m_attr_appid,
                                    sizeof(m_attr_appid));
      APP_ERROR_CHECK(ret);

      // ret = nrf_ble_ancs_c_app_attr_add(&m_ancs_c,
      //                                   BLE_ANCS_APP_ATTR_ID_DISPLAY_NAME,
      //                                   (uint8_t*)m_attr_disp_name,
      //                                   sizeof(m_attr_disp_name));
      // APP_ERROR_CHECK(ret);

      ret = nrf_ble_ancs_c_attr_add(&m_ancs_c,
                                    BLE_ANCS_NOTIF_ATTR_ID_TITLE,
                                    (uint8_t*)m_attr_title,
                                    sizeof(m_attr_title));
      APP_ERROR_CHECK(ret);

      ret = nrf_ble_ancs_c_attr_add(&m_ancs_c,
                                    BLE_ANCS_NOTIF_ATTR_ID_MESSAGE,
                                    (uint8_t*)m_attr_message,
                                    sizeof(m_attr_message));
      APP_ERROR_CHECK(ret);

      ret = nrf_ble_ancs_c_attr_add(&m_ancs_c,
                                    BLE_ANCS_NOTIF_ATTR_ID_SUBTITLE,
                                    (uint8_t*)m_attr_subtitle,
                                    sizeof(m_attr_subtitle));
      APP_ERROR_CHECK(ret);

      ret = nrf_ble_ancs_c_attr_add(&m_ancs_c,
                                    BLE_ANCS_NOTIF_ATTR_ID_MESSAGE_SIZE,
                                    (uint8_t*)m_attr_message_size,
                                    sizeof(m_attr_message_size));
      APP_ERROR_CHECK(ret);

      ret = nrf_ble_ancs_c_attr_add(&m_ancs_c,
                                    BLE_ANCS_NOTIF_ATTR_ID_DATE,
                                    (uint8_t*)m_attr_date,
                                    sizeof(m_attr_date));
      APP_ERROR_CHECK(ret);

      ret = nrf_ble_ancs_c_attr_add(&m_ancs_c,
                                    BLE_ANCS_NOTIF_ATTR_ID_POSITIVE_ACTION_LABEL,
                                    (uint8_t*)m_attr_posaction,
                                    sizeof(m_attr_posaction));
      APP_ERROR_CHECK(ret);

      ret = nrf_ble_ancs_c_attr_add(&m_ancs_c,
                                    BLE_ANCS_NOTIF_ATTR_ID_NEGATIVE_ACTION_LABEL,
                                    (uint8_t*)m_attr_negaction,
                                    sizeof(m_attr_negaction));
      APP_ERROR_CHECK(ret);

      ancs_init_obj.evt_handler   = on_ancs_c_evt;
      ancs_init_obj.error_handler = apple_notification_error_handler;

      ret = ble_ancs_c_init(&m_ancs_c, &ancs_init_obj);
      APP_ERROR_CHECK(ret);
    }

    if (bleStatus & BLE_AMS_INITED) {
      ble_ams_c_init_t ams_c_init;
      // Init the Apple Media Service client module.
      memset(&ams_c_init, 0, sizeof(ams_c_init));

      ams_c_init.evt_handler   = on_ams_c_evt;
      ams_c_init.error_handler = apple_media_error_handler;

      ret = ble_ams_c_init(&m_ams_c, &ams_c_init);
      APP_ERROR_CHECK(ret);
    }
}


/**@brief Function for handling Database Discovery events.
 *
 * @details This function is a callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function should forward the events
 *          to their respective service instances.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
{
  NRF_LOG_INFO("db_disc_handler %d\n", p_evt->evt_type);
  if (bleStatus & BLE_ANCS_INITED)
    ble_ancs_c_on_db_disc_evt(&m_ancs_c, p_evt);
  if (bleStatus & BLE_AMS_INITED)
    ble_ams_c_on_db_disc_evt(&m_ams_c, p_evt);
}

/**@brief Function for handling the security request timer time-out.
 *
 * @details This function is called each time the security request timer expires.
 *
 * @param[in] p_context  Pointer used for passing context information from the
 *                       app_start_timer() call to the time-out handler.
 */
static void sec_req_timeout_handler(void * p_context)
{
    ret_code_t           ret;
    pm_conn_sec_status_t status;

    if (m_peripheral_conn_handle != BLE_CONN_HANDLE_INVALID)
    {

        ret = pm_conn_sec_status_get(m_peripheral_conn_handle, &status);
        APP_ERROR_CHECK_NOT_URGENT(ret);

