espruino/Espruino/targets/nrf5x/bluetooth_ancs.c
        // If the link is still not secured by the peer, initiate security procedure.
        if (!status.encrypted)
        {
            NRF_LOG_INFO("Requesting encryption\n");
            ret = pm_conn_secure(m_peripheral_conn_handle, false);
            if (ret != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK_NOT_URGENT(ret);
            }
        }
    }
}

/**@brief Function for initializing the database discovery module.
 */
void ble_ancs_init() {
  ret_code_t ret;

  // Create security request timer.
  ret = app_timer_create(&m_sec_req_timer_id,
                         APP_TIMER_MODE_SINGLE_SHOT,
                         sec_req_timeout_handler);
  APP_ERROR_CHECK(ret);

  ret = ble_db_discovery_init(db_disc_handler);
  APP_ERROR_CHECK(ret);

  services_init();
}

bool ble_ancs_is_active() {
  return m_ancs_active;
}

bool ble_ams_is_active() {
  return m_ams_active;
}


void ble_ancs_get_adv_uuid(ble_uuid_t *p_adv_uuids) {
  // bool useANCS = bleStatus & BLE_ANCS_INITED;
  // p_adv_uuids[0].uuid = useANCS ? 0xF431/*ANCS_UUID_SERVICE*/ : 0x502B/*AMS_UUID_SERVICE*/;
  // p_adv_uuids[0].type = useANCS ? m_ancs_c.service.service.uuid.type : m_ams_c.service.service.uuid.type;
  
  // Current Time Service has 16-bit UUID 0x1805, and soliciting for this (rather than the 128-bit ANCS UUID)
  // is enough to cause the device to show up in a scan on iOS's Bluetooth settings page
  p_adv_uuids[0].uuid = 0x1805; 
  p_adv_uuids[0].type = BLE_UUID_TYPE_BLE;

}

/// Perform the given action for the current notification (positive/negative)
bool ble_ancs_action(uint32_t uid, bool positive) {
  ret_code_t ret;
  ret = nrf_ancs_perform_notif_action(&m_ancs_c,
                                      uid,
                                      positive ? ACTION_ID_POSITIVE : ACTION_ID_NEGATIVE);
  jsble_check_error(ret);
  return ret==0;
}

// Request the attributes for notification identified by uid
bool ble_ancs_request_notif(uint32_t uid) {
  ret_code_t ret;
  // only the notif_uid field is used.
  m_notification_request.notif_uid = uid;
  m_notification_request.evt_id = BLE_ANCS_EVENT_ID_NOTIFICATION_ADDED;
  // clear old data
  ble_ancs_clear_attr();
  // request attributes
  ret = nrf_ble_ancs_c_request_attrs(&m_ancs_c, &m_notification_request);
  jsble_check_error(ret);
  return ret==0;
}

// Request the attributes for app
bool ble_ancs_request_app(char *app_id, int len) {
  ret_code_t ret;
  // clear old data
  ble_ancs_clear_app_attr();
  // request attributes
  ret = nrf_ble_ancs_c_app_attr_request(&m_ancs_c, (uint8_t*)app_id, len);
  jsble_check_error(ret);
  return ret==0;
}

// Request an AMS player attribute
bool ble_ams_request_player_info(ble_ams_c_player_attribute_id_val_t cmd) {
  ret_code_t ret = ble_ams_c_entity_attribute_write(&m_ams_c, BLE_AMS_ENTITY_ID_PLAYER, cmd);
  jsble_check_error(ret);
  if (ret==0) {
    ret = ble_ams_c_entity_attribute_read(&m_ams_c, 0);
    jsble_check_error(ret);
  }
  return ret==0;
}

// Request an AMS track attribute
bool ble_ams_request_track_info(ble_ams_c_track_attribute_id_val_t cmd) {
  ret_code_t ret = ble_ams_c_entity_attribute_write(&m_ams_c, BLE_AMS_ENTITY_ID_TRACK, cmd);
  jsble_check_error(ret);
  if (ret==0) {
    ret = ble_ams_c_entity_attribute_read(&m_ams_c, 0);
    jsble_check_error(ret);
  }
  return ret==0;
}

// Send a command like play/pause/etc
bool ble_ams_command(ble_ams_c_remote_control_id_val_t cmd) {
  ret_code_t ret = ble_ams_c_remote_command_write(&m_ams_c, cmd);
  jsble_check_error(ret);
  return ret==0;
}
